[
    {
        "heading":"Profile",
        "description":"Result-oriented web developer with over 3 years experience building pixel perfect websites, exceptional user experience, and scalable back end services. Built reusable UI with state management using component driven architecture to create robust and scalable single page applications, and developed self contained services for backend by implementing SOA (Service Oriented Architecture) principles."
    },
    {
        "heading":"Work Experience",
        "description":false,
        "repeatable":[
            
            {
                "title":"Web Developer",
                "duration":"Jan 2018 - Present",
                "institutionName":"Cloud DX",
                "location":"Kitchener, ON, Canada",
                "text":"A licensed medical device manufacturer, distributor and exporter of approved and cleared health information technology products.",
                "listTitle":"Responsibilities:",
                "listItems":[
                    "Add features to legacy web application using ASP.Net web forms, AngularJS, Kendo UI, JavaScript and jQuery.",
                    "Build management and internal tools app using Angular, Angular Material, RxJS, NgRX, Docker, Angular Flex Layout and SCSS",
                    "Develop back end services using .Net Core, Rabbit MQ, Docker and MongoDB"
                ]
            },
            {
                "title":"Web Developer",
                "duration":"June 2015 – July 2016",
                "institutionName":"HackEarth Pvt Ltd",
                "location":"Mohali, Punjab, India",
                "text":"A startup that provides IT solutions to professionals and enterprises.",
                "listTitle":"Responsibilities:",
                "listItems":[
                    "Build front-end using JavaScript, jQuery, and AngularJS",
                    "Create responsive user interfaces using HTML5, CSS3, and Bootstrap",
                    "Develop back-end logic for websites, and Web APIs in PHP and Laravel",
                    "Write SQL commands and stored procedures in MySQL"
                ]
            },
            {
                "title":"Web Developer Internship",
                "duration":"Jan 2015 - June 2015",
                "institutionName":"HackEarth Private Limited",
                "location":"Mohali, Punjab, India",
                "text":"",
                "listTitle":"Responsibilities:",
                "listItems":[
                    "Build UI with HTML5, CSS3, and Bootstrap",
                    "Implement dynamic components using JavaScript and jQuery",
                    "Develop back-end logic in PHP and design a relational database using MySQL"
                ]
            }
        ]
    },
    {
        "heading":"Education",
        "description":false,
        "repeatable":[
            {
                "title":"Mobile Solutions Development",
                "duration":"Sept 2016 - Jan 2018",
                "institutionName":"Conestoga College",
                "location":"Kitchener, ON, Canada",
                "text":"Gained solid understanding of software design concepts. user interface design principles, computer and web application security, and usability testing",
                "listItems":false
            },
            {
                "title":"Bachelor of Technology (Computer Science and Engineering)",
                "duration":"Aug 2011 - June 2015",
                "institutionName":"Chandigarh Group of Colleges",
                "location":"Gharuan, Punjab, India",
                "text":"Immersed in four years of learning technical and programming concepts in the development of software systems, and implemented the knowledge to build enterprise level software and web applications",
                "listItems":false
            }
        ]
    },
    {
        "heading":"Technical Expertise",
        "description":false,
        "repeatable":[
            {
                "listItems":[
                    "Front-end: Angular, Vue JS, React JS, RxJS, Angular Material, NgRX (Redux), Kendo UI,  jQuery, SCSS, and Bootstrap",
                    "Back-end: ASP.Net, Docker, Node JS, Laravel, Rabbit MQ",
                    "Core programming languages: JavaScript, C#, PHP, SQL, HTML5, and CSS3",
                    "Databases: MySQL, Microsoft SQL Server, and MongoDB",
                    "Dev Tools: Git, VS Code, Visual Studio, SQL Server Management Studio, Robo 3T"
                ]
            }
        ]
    }
]
